app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "date_emitted", "kind", "payload", "shared_secret", "updated_at", "user_ID", "user_agent") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@event = Event.create(event_params)